{
  "section": {
    "title": "Stories / Projects",
    "labels": {
      "more": "more…",
      "less": "less…"
    }
  },
  "stories": [
    {
      "id": "story1",
      "title": "Merging Two Software Worlds",
      "body": [
        "As Test Lead, I was responsible for testing a seeder software that existed in two variants – for Europe and for the US.",
        "Both versions had evolved independently. The goal was to merge the EU codebase with the US user interface.",
        "After the first integration, almost nothing worked. Through agile testing cycles, clear prioritization, and close collaboration with development, I managed to stabilize the merged software in a short time. The result was a robust global release that combined the strengths of both systems."
      ]
    },
    {
      "id": "story2",
      "title": "Establishing Structured Testing and Requirements Engineering",
      "body": [
        "In a newly established software department, I introduced Zephyr for Jira together with two colleagues to create, execute, and document test cases systematically.",
        "This enabled traceable testing and direct integration of bug fixes into development.",
        "In parallel, I promoted the use of Polarion for requirements engineering to replace unstructured Confluence pages with version-controlled, traceable specifications. The result was a clear, transparent development process."
      ]
    },
    {
      "id": "story3",
      "title": "SIM Card Surfer (Telecommunication)",
      "body": [
        "I developed an embedded system called SIM Card Surfer as a one-person project.",
        "In developing countries, SIM cards with free minutes were used. The system could read up to 30 SIM cards and transmit their data via TCP/IP to clients abroad – for example, in London.",
        "Since SIM keys could not be extracted, authentication was performed in real time between devices. The result was a stable, cross-border virtual SIM usage solution."
      ]
    },
    {
      "id": "story4",
      "title": "My First Contact with Software Testing",
      "body": [
        "During my time at Deutsche Telekom, I helped establish a support system for a nationwide dispatch application.",
        "The system ran under DOS, was written in Clipper, and used DBASE databases.",
        "I was responsible for support, hotline, and software testing – my first professional contact with software quality and structured testing."
      ]
    },
    {
      "id": "story5",
      "title": "Technical Look Behind the Scenes",
      "body": [
        "This portfolio website is fully built with JavaScript.",
        "All content – navigation, skills, CV, and stories – is dynamically loaded from JSON files. This ensures a clear separation of content, logic, and presentation.",
        "The site is bilingual: all texts are dynamically updated based on the selected language. The underlying HTML is minimal, while the entire layout is rendered client-side."
      ]
    }
  ]
}
