{
  "section": {
    "title": "Stories / Projekte",
    "labels": {
      "more": "mehr…",
      "less": "weniger…"
    }
  },
  "stories": [
    {
      "id": "story1",
      "title": "Zusammenführung zweier Softwarewelten",
      "body": [
        "Als Testlead war ich verantwortlich für das Testen der Software einer Sämaschine, die in zwei Varianten existierte – für Europa und die USA.",
        "Beide Versionen waren unabhängig entwickelt worden. Ziel war, die EU-Codebasis mit der US-Benutzeroberfläche zu vereinen.",
        "Nach der ersten Zusammenführung funktionierte kaum etwas. Durch agile Tests in kurzen Iterationen, gezielte Priorisierung und enge Zusammenarbeit mit der Entwicklung gelang es mir, in kurzer Zeit eine stabile, lauffähige Version zu erreichen. Das Ergebnis war ein globaler Release, der die Stärken beider Systeme vereinte."
      ]
    },
    {
      "id": "story2",
      "title": "Aufbau von strukturiertem Testen und Requirements Engineering",
      "body": [
        "In einer neu gegründeten Softwareabteilung führte ich gemeinsam mit zwei Kollegen Zephyr für Jira ein, um erstmals strukturiert Testfälle anzulegen, auszuführen und zu dokumentieren.",
        "Dadurch wurden Testprozesse nachvollziehbar und Bugfixes direkt in die Entwicklung integriert.",
        "Parallel setzte ich mich dafür ein, Polarion für das Requirements Engineering zu etablieren, um unstrukturierte Confluence-Dokumente durch versionierte, nachvollziehbare Anforderungen zu ersetzen. So entstand ein klarer, transparenter Entwicklungsprozess."
      ]
    },
    {
      "id": "story3",
      "title": "SIM-Karten-Surfer (Telekommunikation)",
      "body": [
        "Ich entwickelte als Ein-Mann-Projekt ein Embedded-System namens SIM-Karten-Surfer.",
        "In Schwellenländern wurden SIM-Karten mit Freiminuten genutzt. Das System konnte bis zu 30 SIM-Karten auslesen und ihre Daten per TCP/IP weltweit an Clients übertragen – beispielsweise nach London.",
        "Da die SIM-Schlüssel nicht ausgelesen werden durften, erfolgte die Authentifizierung in Echtzeit zwischen den Geräten. Das Ergebnis war eine stabile, grenzüberschreitende virtuelle SIM-Nutzung."
      ]
    },
    {
      "id": "story4",
      "title": "Mein erster Kontakt mit Softwaretest",
      "body": [
        "Während meiner Zeit bei der Telekom war ich am Aufbau eines Supportsystems für ein bundesweites Dispositionssystem beteiligt.",
        "Die Anwendung lief unter DOS, war in Clipper entwickelt und nutzte DBASE-Datenbanken.",
        "Ich war verantwortlich für Support, Hotline und Tests – mein erster Kontakt mit Softwarequalität und Testprozessen, lange bevor das Thema offiziell in meiner Laufbahn eine zentrale Rolle spielte."
      ]
    },
    {
      "id": "story5",
      "title": "Technischer Blick hinter die Kulissen",
      "body": [
        "Diese Portfolio-Webseite basiert vollständig auf JavaScript.",
        "Alle Inhalte – Navigation, Skills, Lebenslauf und Stories – werden dynamisch aus JSON-Dateien geladen. Dadurch sind Inhalt, Logik und Darstellung klar getrennt.",
        "Die Seite unterstützt außerdem Zweisprachigkeit: Texte werden je nach gewählter Sprache dynamisch nachgeladen und aktualisiert. Das zugrunde liegende HTML ist minimal – der gesamte Aufbau erfolgt clientseitig."
      ]
    }
  ]
}
