{
  "section": {
    "title": "Stories / Projects",
    "labels": {
      "readMore": "Read more",
      "close": "Close"
    }
  },
  "items": [
    {
      "id": "story1",
      "title": "Merging Two Software Worlds",
      "subtitle": "Test Lead · Seeder (EU code + US UI)",
      "excerpt": "Owned testing and stabilization after merging EU codebase with US UI under a tight schedule.",
      "body": "As Test Lead, I handled testing of two regional variants (EU/US). After merging EU code with the US UI, core flows broke. I established short, agile test cycles with clear priorities and rapid feedback to dev. Result: a stable, shippable release that combined the strengths of both systems."
    },
    {
      "id": "story2",
      "title": "Structured Testing & Requirements",
      "subtitle": "Zephyr in Jira · Polarion · Team enablement",
      "excerpt": "Introduced Zephyr (test authoring, execution, documentation) and moved requirements to Polarion.",
      "body": "Together with two colleagues, I introduced Zephyr in Jira: proper test artifacts, traceable execution, documented results, direct bugfix loops. In parallel, I drove Polarion adoption for requirements—replacing unstructured Confluence pages with versioned, traceable specs."
    },
    {
      "id": "story3",
      "title": "SIM Card Surfer (Telecom)",
      "subtitle": "Solo project · Embedded · TENOL · TCP/IP",
      "excerpt": "Embedded solution for remote SIM usage; data transport and real-time auth without exporting keys.",
      "body": "Built a SIM Surfer handling up to 30 SIMs in emerging markets. Read via TENOL, streamed over TCP/IP to a client (e.g., London). Keys were never exported; authentication ran in real time between endpoints. Outcome: reliable cross-border virtual SIM usage."
    },
    {
      "id": "story4",
      "title": "My First Touchpoint with Testing",
      "subtitle": "Telekom · Clipper · DBASE · DOS",
      "excerpt": "Support and pre-release testing for a nationwide dispatch system—my QA starting point.",
      "body": "Within a central working group (FTZ Darmstadt), I owned support, hotline, and pre-release tests for a dispatch system (Clipper on DOS, DBASE). This shaped my early understanding of structured QA and release quality."
    },
    {
      "id": "story5",
      "title": "Technical Look Behind the Scenes",
      "subtitle": "JavaScript · JSON · Bilingual",
      "excerpt": "Site is rendered in JavaScript; content is JSON-driven; bilingual UI updates dynamically.",
      "body": "The entire portfolio is rendered via JavaScript. Content (navigation, skills, CV, stories) is loaded from JSON, cleanly separating content/logic/presentation. Bilingual (DE/EN) texts are updated dynamically via applyTexts(); the static HTML remains minimal."
    }
  ]
}
